Diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ВКМ_ЗаполнениеГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ЗаполнениеГрафика</name>
</mdclass:DataProcessor>

Diplom/src/InformationRegisters/ВКМ_ГрафикРабот/ВКМ_ГрафикРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикРабот</name>
  <resources>
    <name>РабочихДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КалендарныхДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Diplom/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ObjectModule.bsl
Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, ГрафикРаботы) Экспорт 
	
	Набор = РегистрыСведений.ВКМ_ГрафикРабот.СоздатьНаборЗаписей();
	Набор.Отбор.ГрафикРаботы.Установить(ГрафикРаботы);
	
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	Для к = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[к];
		Если Запись.Дата < ДатаНачала Тогда
		    Продолжить;
		ИначеЕсли Запись.Дата =Дат Тогда
			Запись.КалендарныхДней = 1;
			Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
				Запись.РабочихДней = 0;
			Иначе	          
				Запись.РабочихДней = 1;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		Иначе
			Пока Дат < Мин(Запись.Дата, ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.ГрафикРаботы = ГрафикРаботы;
				НоваяЗапись.Дата = Дат;
				НоваяЗапись.КалендарныхДней = 1;
				Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					НоваяЗапись.РабочихДней = 0;
				Иначе	          
					НоваяЗапись.РабочихДней = 1;
				КонецЕсли; 
				Дат = Дат + ЧислоСекундВСутках;
			КонецЦикла; 
			Если Запись.Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Запись.КалендарныхДней = 1;
				Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					Запись.РабочихДней = 0;
				Иначе	          
					Запись.РабочихДней = 1;
				КонецЕсли;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		КонецЕсли; 
	КонецЦикла;
	Набор.Записать();
	
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.ГрафикРаботы = ГрафикРаботы;
		Запись.Дата = Дат; 
		Запись.КалендарныхДней = 1;
		Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			Запись.РабочихДней = 0;
		Иначе	          
			Запись.РабочихДней = 1;
		КонецЕсли; 
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла; 
	Набор.Записать();
	
	//Пока Дат <= ДатаОкончания Цикл
	//	Запись = Набор.Добавить();
	//	Запись.Дата = Дат;
	//	Запись.ГрафикРаботы = ГрафикРаботы;
	//	Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
	//		Запись.РабочихДней = 0;
	//	Иначе	          
	//		Запись.РабочихДней = 1;
	//	КонецЕсли; 
	//	Дат = Дат + ЧислоСекундВСутках;
	//КонецЦикла; 
	//Набор.Записать();
КонецПроцедуры
